{

"licenses":
[{"fullname": "3dfx Glide License", "shortname": "Glide", "text": "3DFX GLIDE Source Code General Public License", "header": ""}, {"fullname": "Abstyles License", "shortname": "Abstyles", "text": "This is APREAMBL.TEX, version 1.10e, written by Hans-Hermann Bode (HHBODE@DOSUNI1.BITNET), for the BibTeX `adaptable' family, version 1.10. See the file APREAMBL.DOC for a detailed documentation.", "header": ""}, {"fullname": "Academic Free License v1.1", "shortname": "AFL-1.1", "text": "Academic Free License Version 1.1", "header": "\"Licensed under the Academic Free License version 1.1.\""}, {"fullname": "Academic Free License v1.2", "shortname": "AFL-1.2", "text": "Academic Free License Version 1.2", "header": "Licensed under the Academic Free License version 1.2"}, {"fullname": "Academic Free License v2.0", "shortname": "AFL-2.0", "text": "The Academic Free License v. 2.0", "header": "Licensed under the Academic Free License version 2.0"}, {"fullname": "Academic Free License v2.1", "shortname": "AFL-2.1", "text": "The Academic Free License v.2.1", "header": "Licensed under the Academic Free License version 2.1"}, {"fullname": "Academic Free License v3.0", "shortname": "AFL-3.0", "text": "Academic Free License (\"AFL\") v. 3.0", "header": "Licensed under the Academic Free License version 3.0"}, {"fullname": "Academy of Motion Picture Arts and Sciences BSD", "shortname": "AMPAS", "text": "Copyright (c) 2006 Academy of Motion Picture Arts and Sciences (\"A.M.P.A.S.\"). Portions contributed by others as indicated. All rights reserved.", "header": ""}, {"fullname": "Adaptive Public License 1.0", "shortname": "APL-1.0", "text": "ADAPTIVE PUBLIC LICENSE Version 1.0", "header": ""}, {"fullname": "Adobe Glyph List License", "shortname": "Adobe-Glyph", "text": "Copyright (c) 1997,1998,2002,2007 Adobe Systems Incorporated", "header": ""}, {"fullname": "Adobe Postscript AFM License", "shortname": "APAFML", "text": "Copyright (c) 1985, 1987, 1989, 1990, 1991, 1992, 1993, 1997 Adobe Systems Incorporated. All Rights Reserved.", "header": ""}, {"fullname": "Adobe Systems Incorporated Source Code License Agreement", "shortname": "Adobe-2006", "text": "Adobe Systems Incorporated(r) Source Code License Agreement", "header": ""}, {"fullname": "Affero General Public License v1.0", "shortname": "AGPL-1.0", "text": "AFFERO GENERAL PUBLIC LICENSE Version 1, March 2002", "header": ""}, {"fullname": "Afmparse License", "shortname": "Afmparse", "text": "(C) 1988, 1989 by Adobe Systems Incorporated. All rights reserved.", "header": ""}, {"fullname": "Aladdin Free Public License", "shortname": "Aladdin", "text": "Aladdin Free Public License (Version 8, November 18, 1999)", "header": ""}, {"fullname": "Amazon Digital Services License", "shortname": "ADSL", "text": "This software code is made available \"AS IS\" without warranties of any kind. You may copy, display, modify and redistribute the software code either by itself or as incorporated into your code; provided that you do not remove any proprietary notices. Your use of this software code is at your own risk and you waive any claim against Amazon Digital Services, Inc. or its affiliates with respect to your use of this software code. (c) 2006 Amazon Digital Services, Inc. or its affiliates.", "header": ""}, {"fullname": "AMD's plpa_map.c License", "shortname": "AMDPLPA", "text": "Copyright (c) 2006, 2007 Advanced Micro Devices, Inc. All rights reserved.", "header": ""}, {"fullname": "ANTLR Software Rights Notice", "shortname": "ANTLR-PD", "text": "ANTLR 2 License", "header": ""}, {"fullname": "Apache License 1.0", "shortname": "Apache-1.0", "text": "Copyright (c) 1995-1999 The Apache Group. All rights reserved.", "header": ""}, {"fullname": "Apache License 1.1", "shortname": "Apache-1.1", "text": "Apache License 1.1", "header": ""}, {"fullname": "Apache License 2.0", "shortname": "Apache-2.0", "text": "Apache License Version 2.0, January 2004 http://www.apache.org/licenses/", "header": "Copyright [yyyy] [name of copyright owner] Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License."}, {"fullname": "Apple MIT License", "shortname": "AML", "text": "Copyright: Copyright (c) 2006 by Apple Computer, Inc., All Rights Reserved.", "header": ""}, {"fullname": "Apple Public Source License 1.0", "shortname": "APSL-1.0", "text": "APPLE PUBLIC SOURCE LICENSE Version 1.0 - March 16, 1999", "header": ""}, {"fullname": "Apple Public Source License 1.1", "shortname": "APSL-1.1", "text": "APPLE PUBLIC SOURCE LICENSE Version 1.1 - April 19, 1999", "header": ""}, {"fullname": "Apple Public Source License 1.2", "shortname": "APSL-1.2", "text": "Apple Public Source License Ver. 1.2", "header": ""}, {"fullname": "Artistic License 1.0", "shortname": "Artistic-1.0", "text": "The Artistic License", "header": ""}, {"fullname": "Artistic License 1.0 (Perl)", "shortname": "Artistic-1.0-Perl", "text": "The \"Artistic License\"", "header": ""}, {"fullname": "Artistic License 1.0 w/clause 8", "shortname": "Artistic-1.0-cl8", "text": "The Artistic License", "header": ""}, {"fullname": "Artistic License 2.0", "shortname": "Artistic-2.0", "text": "The Artistic License 2.0", "header": ""}, {"fullname": "Attribution Assurance License", "shortname": "AAL", "text": "Attribution Assurance License", "header": ""}, {"fullname": "Bahyph License", "shortname": "Bahyph", "text": "COPYRIGHT NOTICE", "header": ""}, {"fullname": "Barr License", "shortname": "Barr", "text": "This is a package of commutative diagram macros built on top of Xy-pic by Michael Barr (email: barr@barrs.org). Its use is unrestricted. It may be freely distributed, unchanged, for non-commercial or commercial use. If changed, it must be renamed. Inclusion in a commercial software package is also permitted, but I would appreciate receiving a free copy for my personal examination and use. There are no guarantees that this package is good for anything. I have tested it with LaTeX 2e, LaTeX 2.09 and Plain TeX. Although I know of no reason it will not work with AMSTeX, I have not tested it.", "header": ""}, {"fullname": "Beerware License", "shortname": "Beerware", "text": "\"THE BEER-WARE LICENSE\" (Revision 42): wrote this file. As long as you retain this notice you can do whatever you want with this stuff. If we meet some day, and you think this stuff is worth it, you can buy me a beer in return Poul-Henning Kamp", "header": ""}, {"fullname": "BitTorrent Open Source License v1.0", "shortname": "BitTorrent-1.0", "text": "BitTorrent Open Source License Version 1.0", "header": "The contents of this file are subject to the BitTorrent Open Source License Version 1.0 (the License). You may not copy or use this file, in either source code or executable form, except in compliance with the License. You may obtain a copy of the License at http://www.bittorrent.com/license/. Software distributed under the License is distributed on an AS IS basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License."}, {"fullname": "BitTorrent Open Source License v1.1", "shortname": "BitTorrent-1.1", "text": "BitTorrent Open Source License Version 1.1", "header": "The contents of this file are subject to the BitTorrent Open Source License Version 1.1 (the License). You may not copy or use this file, in either source code or executable form, except in compliance with the License. You may obtain a copy of the License at http://www.bittorrent.com/license/. Software distributed under the License is distributed on an AS IS basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License."}, {"fullname": "Boost Software License 1.0", "shortname": "BSL-1.0", "text": "Boost Software License - Version 1.0 - August 17th, 2003", "header": ""}, {"fullname": "Borceux license", "shortname": "Borceux", "text": "Copyright 1993 Francis Borceux", "header": ""}, {"fullname": "BSD 2-Clause \"Simplified\" License", "shortname": "BSD-2-Clause", "text": "Copyright (c) . All rights reserved.", "header": ""}, {"fullname": "BSD 2-Clause FreeBSD License", "shortname": "BSD-2-Clause-FreeBSD", "text": "The FreeBSD Copyright", "header": ""}, {"fullname": "BSD 2-Clause NetBSD License", "shortname": "BSD-2-Clause-NetBSD", "text": "Copyright (c) 2008 The NetBSD Foundation, Inc. All rights reserved.", "header": ""}, {"fullname": "BSD 3-Clause \"New\" or \"Revised\" License", "shortname": "BSD-3-Clause", "text": "Copyright (c) . All rights reserved.", "header": ""}, {"fullname": "BSD 3-Clause Clear License", "shortname": "BSD-3-Clause-Clear", "text": "The Clear BSD License", "header": ""}, {"fullname": "BSD 3-Clause No Nuclear License", "shortname": "BSD-3-Clause-No-Nuclear-License", "text": "Copyright 1994-2009 Sun Microsystems, Inc. All Rights Reserved.", "header": ""}, {"fullname": "BSD 3-Clause No Nuclear License 2014", "shortname": "BSD-3-Clause-No-Nuclear-License-2014", "text": "Copyright Â© 2008, 2014 Oracle and/or its affiliates. All rights reserved.", "header": ""}, {"fullname": "BSD 3-Clause No Nuclear Warranty", "shortname": "BSD-3-Clause-No-Nuclear-Warranty", "text": "Copyright (c) 2003-2005 Sun Microsystems, Inc. All Rights Reserved.", "header": ""}, {"fullname": "BSD 4-Clause \"Original\" or \"Old\" License", "shortname": "BSD-4-Clause", "text": "Copyright (c) . All rights reserved.", "header": ""}, {"fullname": "BSD Protection License", "shortname": "BSD-Protection", "text": "BSD Protection License February 2002", "header": ""}, {"fullname": "BSD Source Code Attribution", "shortname": "BSD-Source-Code", "text": "Copyright (c) 2011, Deusty, LLC All rights reserved.", "header": ""}, {"fullname": "BSD with attribution", "shortname": "BSD-3-Clause-Attribution", "text": "Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. 4. Redistributions of any form whatsoever must retain the following acknowledgment: 'This product includes software developed by the \"Universidad de Palermo, Argentina\" (http://www.palermo.edu/).' THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.", "header": ""}, {"fullname": "BSD Zero Clause License", "shortname": "0BSD", "text": "BSD Zero Clause License", "header": ""}, {"fullname": "BSD-4-Clause (University of California-Specific)", "shortname": "BSD-4-Clause-UC", "text": "BSD-4-Clause (University of California-Specific)", "header": ""}, {"fullname": "bzip2 and libbzip2 License v1.0.5", "shortname": "bzip2-1.0.5", "text": "Version 1.0.5 of 10 December 2007", "header": ""}, {"fullname": "bzip2 and libbzip2 License v1.0.6", "shortname": "bzip2-1.0.6", "text": "This program, \"bzip2\", the associated library \"libbzip2\", and all documentation, are copyright (C) 1996-2010 Julian R Seward. All rights reserved.", "header": ""}, {"fullname": "Caldera License", "shortname": "Caldera", "text": "Caldera International, Inc. hereby grants a fee free license that includes the rights use, modify and distribute this named source code, including creating derived binary products created from the source code. The source code for which Caldera International, Inc. grants rights are limited to the following UNIX Operating Systems that operate on the 16-Bit PDP-11 CPU and early versions of the 32-Bit UNIX Operating System, with specific exclusion of UNIX System III and UNIX System V and successor operating systems: 32-bit 32V UNIX 16 bit UNIX Versions 1, 2, 3, 4, 5, 6, 7 Caldera International, Inc. makes no guarantees or commitments that any source code is available from Caldera International, Inc. The following copyright notice applies to the source code files for which this license is granted. Copyright(C) Caldera International Inc. 2001-2002. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: Redistributions of source code and documentation must retain the above copyright notice, this list of conditions and the following disclaimer. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. All advertising materials mentioning features or use of this software must display the following acknowledgement: This product includes software developed or owned by Caldera International, Inc. Neither the name of Caldera International, Inc. nor the names of other contributors may be used to endorse or promote products derived from this software without specific prior written permission. USE OF THE SOFTWARE PROVIDED FOR UNDER THIS LICENSE BY CALDERA INTERNATIONAL, INC. AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL CALDERA INTERNATIONAL, INC. BE LIABLE FOR ANY DIRECT, INDIRECT INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.", "header": ""}, {"fullname": "CeCILL Free Software License Agreement v1.0", "shortname": "CECILL-1.0", "text": "CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL", "header": ""}, {"fullname": "CeCILL Free Software License Agreement v1.1", "shortname": "CECILL-1.1", "text": "FREE SOFTWARE LICENSING AGREEMENT CeCILL", "header": ""}, {"fullname": "CeCILL Free Software License Agreement v2.0", "shortname": "CECILL-2.0", "text": "CeCILL FREE SOFTWARE LICENSE AGREEMENT", "header": ""}, {"fullname": "CeCILL Free Software License Agreement v2.1", "shortname": "CECILL-2.1", "text": "CeCILL FREE SOFTWARE LICENSE AGREEMENT", "header": ""}, {"fullname": "CeCILL-B Free Software License Agreement", "shortname": "CECILL-B", "text": "CeCILL-B FREE SOFTWARE LICENSE AGREEMENT", "header": ""}, {"fullname": "CeCILL-C Free Software License Agreement", "shortname": "CECILL-C", "text": "CeCILL-C FREE SOFTWARE LICENSE AGREEMENT", "header": ""}, {"fullname": "Clarified Artistic License", "shortname": "ClArtistic", "text": "The Clarified Artistic License", "header": ""}, {"fullname": "CMU License", "shortname": "MIT-CMU", "text": "", "header": ""}, {"fullname": "CNRI Jython License", "shortname": "CNRI-Jython", "text": "1. This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an office at 1895 Preston White Drive, Reston, VA 20191 (\"CNRI\"), and the Individual or Organization (\"Licensee\") accessing and using JPython version 1.1.x in source or binary form and its associated documentation as provided herein (\"Software\"). 2. Subject to the terms and conditions of this License Agreement, CNRI hereby grants Licensee a non-exclusive, non-transferable, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use the Software alone or in any derivative version, provided, however, that CNRI's License Agreement and CNRI's notice of copyright, i.e., \"Copyright (c) 1996-1999 Corporation for National Research Initiatives; All Rights Reserved\" are both retained in the Software, alone or in any derivative version prepared by Licensee. Alternatively, in lieu of CNRI's License Agreement, Licensee may substitute the following text (omitting the quotes), provided, however, that such text is displayed prominently in the Software alone or in any derivative version prepared by Licensee: \"JPython (Version 1.1.x) is made available subject to the terms and conditions in CNRI's License Agreement. This Agreement may be located on the Internet using the following unique, persistent identifier (known as a handle): 1895.22/1006. The License may also be obtained from a proxy server on the Web using the following URL: http://hdl.handle.net/1895.22/1006.\" 3. In the event Licensee prepares a derivative work that is based on or incorporates the Software or any part thereof, and wants to make the derivative work available to the public as provided herein, then Licensee hereby agrees to indicate in any such work, in a prominently visible way, the nature of the modifications made to CNRI's Software. 4. Licensee may not use CNRI trademarks or trade name, including JPython or CNRI, in a trademark sense to endorse or promote products or services of Licensee, or any third party. Licensee may use the mark JPython in connection with Licensee's derivative versions that are based on or incorporate the Software, but only in the form \"JPython-based ___________________,\" or equivalent. 5. CNRI is making the Software available to Licensee on an \"AS IS\" basis. CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 6. CNRI SHALL NOT BE LIABLE TO LICENSEE OR OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. SOME STATES DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY SO THE ABOVE DISCLAIMER MAY NOT APPLY TO LICENSEE. 7. This License Agreement may be terminated by CNRI (i) immediately upon written notice from CNRI of any material breach by the Licensee, if the nature of the breach is such that it cannot be promptly remedied; or (ii) sixty (60) days following notice from CNRI to Licensee of a material remediable breach, if Licensee has not remedied such breach within that sixty-day period. 8. This License Agreement shall be governed by and interpreted in all respects by the law of the State of Virginia, excluding conflict of law provisions. Nothing in this Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between CNRI and Licensee. 9. By clicking on the \"ACCEPT\" button where indicated, or by installing, copying or otherwise using the Software, Licensee agrees to be bound by the terms and conditions of this License Agreement.", "header": ""}, {"fullname": "CNRI Python License", "shortname": "CNRI-Python", "text": "CNRI OPEN SOURCE LICENSE AGREEMENT", "header": ""}, {"fullname": "CNRI Python Open Source GPL Compatible License Agreement", "shortname": "CNRI-Python-GPL-Compatible", "text": "CNRI OPEN SOURCE GPL-COMPATIBLE LICENSE AGREEMENT", "header": ""}, {"fullname": "Code Project Open License 1.02", "shortname": "CPOL-1.02", "text": "The Code Project Open License (CPOL) 1.02", "header": ""}, {"fullname": "Common Development and Distribution License 1.0", "shortname": "CDDL-1.0", "text": "COMMON DEVELOPMENT AND DISTRIBUTION LICENSE (CDDL) Version 1.0", "header": ""}, {"fullname": "Common Development and Distribution License 1.1", "shortname": "CDDL-1.1", "text": "COMMON DEVELOPMENT AND DISTRIBUTION LICENSE (CDDL) Version 1.1", "header": ""}, {"fullname": "Common Public Attribution License 1.0", "shortname": "CPAL-1.0", "text": "Common Public Attribution License Version 1.0 (CPAL)", "header": "\"The contents of this file are subject to the Common Public Attribution License Version 1.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at _____________. The License is based on the Mozilla Public License Version 1.1 but Sections 14 and 15 have been added to cover use of software over a computer network and provide for limited attribution for the Original Developer. In addition, Exhibit A has been modified to be consistent with Exhibit B. Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code is ______________________. The Original Developer is not the Initial Developer and is __________. If left blank, the Original Developer is the Initial Developer. The Initial Developer of the Original Code is ____________. All portions of the code written by ___________ are Copyright (c) _____. All Rights Reserved. Contributor ______________________. Alternatively, the contents of this file may be used under the terms of the _____ license (the [___] License), in which case the provisions of [______] License are applicable instead of those above. If you wish to allow use of your version of this file only under the terms of the [____] License and not to allow others to use your version of this file under the CPAL, indicate your decision by deleting the provisions above and replace them with the notice and other provisions required by the [___] License. If you do not delete the provisions above, a recipient may use your version of this file under either the CPAL or the [___] License.\""}, {"fullname": "Common Public License 1.0", "shortname": "CPL-1.0", "text": "Common Public License Version 1.0", "header": ""}, {"fullname": "Computer Associates Trusted Open Source License 1.1", "shortname": "CATOSL-1.1", "text": "Computer Associates Trusted Open Source License Version 1.1", "header": ""}, {"fullname": "Condor Public License v1.1", "shortname": "Condor-1.1", "text": "Condor Public License Version 1.1, October 30, 2003", "header": ""}, {"fullname": "Creative Commons Attribution 1.0 Generic", "shortname": "CC-BY-1.0", "text": "Creative Commons Attribution 1.0", "header": ""}, {"fullname": "Creative Commons Attribution 2.0 Generic", "shortname": "CC-BY-2.0", "text": "Creative Commons Attribution 2.0", "header": ""}, {"fullname": "Creative Commons Attribution 2.5 Generic", "shortname": "CC-BY-2.5", "text": "Creative Commons Attribution 2.5", "header": ""}, {"fullname": "Creative Commons Attribution 3.0 Unported", "shortname": "CC-BY-3.0", "text": "Creative Commons Attribution 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution 4.0 International", "shortname": "CC-BY-4.0", "text": "Creative Commons Attribution 4.0 International", "header": ""}, {"fullname": "Creative Commons Attribution No Derivatives 1.0 Generic", "shortname": "CC-BY-ND-1.0", "text": "Creative Commons Attribution-NoDerivs 1.0", "header": ""}, {"fullname": "Creative Commons Attribution No Derivatives 2.0 Generic", "shortname": "CC-BY-ND-2.0", "text": "Creative Commons Attribution-NoDerivs 2.0", "header": ""}, {"fullname": "Creative Commons Attribution No Derivatives 2.5 Generic", "shortname": "CC-BY-ND-2.5", "text": "Creative Commons Attribution-NoDerivs 2.5", "header": ""}, {"fullname": "Creative Commons Attribution No Derivatives 3.0 Unported", "shortname": "CC-BY-ND-3.0", "text": "Creative Commons Attribution-NoDerivs 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution No Derivatives 4.0 International", "shortname": "CC-BY-ND-4.0", "text": "Creative Commons Attribution-NoDerivatives 4.0 International", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial 1.0 Generic", "shortname": "CC-BY-NC-1.0", "text": "Creative Commons Attribution-NonCommercial 1.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial 2.0 Generic", "shortname": "CC-BY-NC-2.0", "text": "Creative Commons Attribution-NonCommercial 2.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial 2.5 Generic", "shortname": "CC-BY-NC-2.5", "text": "Creative Commons Attribution-NonCommercial 2.5", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial 3.0 Unported", "shortname": "CC-BY-NC-3.0", "text": "Creative Commons Attribution-NonCommercial 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial 4.0 International", "shortname": "CC-BY-NC-4.0", "text": "Creative Commons Attribution-NonCommercial 4.0 International", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial No Derivatives 1.0 Generic", "shortname": "CC-BY-NC-ND-1.0", "text": "Creative Commons Attribution-NoDerivs-NonCommercial 1.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial No Derivatives 2.0 Generic", "shortname": "CC-BY-NC-ND-2.0", "text": "Creative Commons Attribution-NonCommercial-NoDerivs 2.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial No Derivatives 2.5 Generic", "shortname": "CC-BY-NC-ND-2.5", "text": "Creative Commons Attribution-NonCommercial-NoDerivs 2.5", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial No Derivatives 3.0 Unported", "shortname": "CC-BY-NC-ND-3.0", "text": "Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial No Derivatives 4.0 International", "shortname": "CC-BY-NC-ND-4.0", "text": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial Share Alike 1.0 Generic", "shortname": "CC-BY-NC-SA-1.0", "text": "Creative Commons Attribution-NonCommercial-ShareAlike 1.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial Share Alike 2.0 Generic", "shortname": "CC-BY-NC-SA-2.0", "text": "Creative Commons Attribution-NonCommercial-ShareAlike 2.0", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial Share Alike 2.5 Generic", "shortname": "CC-BY-NC-SA-2.5", "text": "Creative Commons Attribution-NonCommercial-ShareAlike 2.5", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial Share Alike 3.0 Unported", "shortname": "CC-BY-NC-SA-3.0", "text": "Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution Non Commercial Share Alike 4.0 International", "shortname": "CC-BY-NC-SA-4.0", "text": "Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International", "header": ""}, {"fullname": "Creative Commons Attribution Share Alike 1.0 Generic", "shortname": "CC-BY-SA-1.0", "text": "Creative Commons Attribution-ShareAlike 1.0", "header": ""}, {"fullname": "Creative Commons Attribution Share Alike 2.0 Generic", "shortname": "CC-BY-SA-2.0", "text": "Creative Commons Attribution-ShareAlike 2.0", "header": ""}, {"fullname": "Creative Commons Attribution Share Alike 2.5 Generic", "shortname": "CC-BY-SA-2.5", "text": "Creative Commons Attribution-ShareAlike 2.5", "header": ""}, {"fullname": "Creative Commons Attribution Share Alike 3.0 Unported", "shortname": "CC-BY-SA-3.0", "text": "Creative Commons Attribution-ShareAlike 3.0 Unported", "header": ""}, {"fullname": "Creative Commons Attribution Share Alike 4.0 International", "shortname": "CC-BY-SA-4.0", "text": "Creative Commons Attribution-ShareAlike 4.0 International", "header": ""}, {"fullname": "Creative Commons Zero v1.0 Universal", "shortname": "CC0-1.0", "text": "Creative Commons Legal Code", "header": ""}, {"fullname": "Crossword License", "shortname": "Crossword", "text": "Copyright (C) 1995-2009 Gerd Neugebauer", "header": ""}, {"fullname": "CrystalStacker License", "shortname": "CrystalStacker", "text": "Crystal Stacker is freeware. This means you can pass copies around freely provided you include this document in it's original form in your distribution. Please see the \"Contacting Us\" section of this document if you need to contact us for any reason. Disclaimer NewCreature Design makes no guarantees regarding the Crystal Stacker software. We are not responsible for damages caused by it, though the software is not known to cause any problems. If you have trouble with the software, see the \"Contacting Us\" section of this document. The source code is provided as-is and you may do with it whatsoever you please provided that you include this file in its unmodified form with any new distribution. NewCreature Design makes no gaurantees regarding the usability of the source but are willing to help with any problems you might run into. Please see the \"Contacting Us\" section of this document if you need to get in touch with us about any issues you have regarding the source.", "header": ""}, {"fullname": "CUA Office Public License v1.0", "shortname": "CUA-OPL-1.0", "text": "CUA Office Public License Version 1.0", "header": "\"The contents of this file are subject to the CUA Office Public License Version 1.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://cuaoffice.sourceforge.net/ Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code is ______________________________________. The Initial Developer of the Original Code is ________________________. Portions created by ______________________ are Copyright (C) ______ _______________________. All Rights Reserved. Contributor(s): ______________________________________. Alternatively, the contents of this file may be used under the terms of the _____ license (the \"[___] License\"), in which case the provisions of [______] License are applicable instead of those above. If you wish to allow use of your version of this file only under the terms of the [____] License and not to allow others to use your version of this file under the CUAPL, indicate your decision by deleting the provisions above and replace them with the notice and other provisions required by the [___] License. If you do not delete the provisions above, a recipient may use your version of this file under either the CUAPL or the [___] License.\""}, {"fullname": "Cube License", "shortname": "Cube", "text": "Cube game engine source code, 20 dec 2003 release.", "header": ""}, {"fullname": "curl License", "shortname": "curl", "text": "COPYRIGHT AND PERMISSION NOTICE", "header": ""}, {"fullname": "Deutsche Freie Software Lizenz", "shortname": "D-FSL-1.0", "text": "Deutsche Freie Software Lizenz", "header": ""}, {"fullname": "diffmark license", "shortname": "diffmark", "text": "1. you can do what you want with it 2. I refuse any responsibility for the consequences", "header": ""}, {"fullname": "Do What The F*ck You Want To Public License", "shortname": "WTFPL", "text": "DO WHAT THE FUCK YOU WANT TO PUBLIC LICENSE Version 2, December 2004", "header": ""}, {"fullname": "DOC License", "shortname": "DOC", "text": "Copyright and Licensing Information for ACE(TM), TAO(TM), CIAO(TM), DAnCE(TM), and CoSMIC(TM)", "header": ""}, {"fullname": "Dotseqn License", "shortname": "Dotseqn", "text": "Copyright (C) 1995 by Donald Arseneau", "header": ""}, {"fullname": "DSDP License", "shortname": "DSDP", "text": "COPYRIGHT NOTIFICATION", "header": ""}, {"fullname": "dvipdfm License", "shortname": "dvipdfm", "text": "A modified version of this file may be distributed, but it should be distributed with a *different* name. Changed files must be distributed *together with a complete and unchanged* distribution of these files.", "header": ""}, {"fullname": "Eclipse Public License 1.0", "shortname": "EPL-1.0", "text": "Eclipse Public License - v 1.0", "header": ""}, {"fullname": "Educational Community License v1.0", "shortname": "ECL-1.0", "text": "The Educational Community License", "header": "Copyright (c) Licensed under the Educational Community License version 1.0"}, {"fullname": "Educational Community License v2.0", "shortname": "ECL-2.0", "text": "Educational Community License Version 2.0, April 2007", "header": "Copyright [yyyy] [name of copyright owner] Licensed under the Educational Community License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.osedu.org/licenses/ECL-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License."}, {"fullname": "eGenix.com Public License 1.1.0", "shortname": "eGenix", "text": "EGENIX.COM PUBLIC LICENSE AGREEMENT Version 1.1.0", "header": ""}, {"fullname": "Eiffel Forum License v1.0", "shortname": "EFL-1.0", "text": "Eiffel Forum License, version 1", "header": ""}, {"fullname": "Eiffel Forum License v2.0", "shortname": "EFL-2.0", "text": "Eiffel Forum License, version 2", "header": ""}, {"fullname": "Enlightenment License (e16)", "shortname": "MIT-advertising", "text": "Copyright (C) 2000-2008 Carsten Haitzler, Geoff Harrison and various contributors Copyright (C) 2004-2008 Kim Woelders", "header": ""}, {"fullname": "enna License", "shortname": "MIT-enna", "text": "Copyright (C) 2000 Carsten Haitzler and various contributors (see AUTHORS)", "header": ""}, {"fullname": "Entessa Public License v1.0", "shortname": "Entessa", "text": "Entessa Public License Version. 1.0", "header": ""}, {"fullname": "Erlang Public License v1.1", "shortname": "ErlPL-1.1", "text": "ERLANG PUBLIC LICENSE Version 1.1", "header": ""}, {"fullname": "EU DataGrid Software License", "shortname": "EUDatagrid", "text": "EU DataGrid Software License", "header": ""}, {"fullname": "European Union Public License 1.0", "shortname": "EUPL-1.0", "text": "European Union Public Licence V.1.0", "header": ""}, {"fullname": "European Union Public License 1.1", "shortname": "EUPL-1.1", "text": "European Union Public Licence V. 1.1", "header": ""}, {"fullname": "Eurosym License", "shortname": "Eurosym", "text": "Copyright (c) 1999-2002 Henrik Theiling", "header": ""}, {"fullname": "Fair License", "shortname": "Fair", "text": "Fair License", "header": ""}, {"fullname": "feh License", "shortname": "MIT-feh", "text": "Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies of the Software and its documentation and acknowledgment shall be given in the documentation and software packages that this Software was used. THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.", "header": ""}, {"fullname": "Frameworx Open License 1.0", "shortname": "Frameworx-1.0", "text": "THE FRAMEWORX OPEN LICENSE 1.0", "header": ""}, {"fullname": "FreeImage Public License v1.0", "shortname": "FreeImage", "text": "FreeImage Public License - Version 1.0", "header": ""}, {"fullname": "Freetype Project License", "shortname": "FTL", "text": "The FreeType Project LICENSE 2006-Jan-27", "header": ""}, {"fullname": "FSF All Permissive License", "shortname": "FSFAP", "text": "Copying and distribution of this file, with or without modification, are permitted in any medium without royalty provided the copyright notice and this notice are preserved. This file is offered as-is, without any warranty.", "header": ""}, {"fullname": "FSF Unlimited License", "shortname": "FSFUL", "text": "Copyright (C) 1992-1996, 1998-2012 Free Software Foundation, Inc.", "header": ""}, {"fullname": "FSF Unlimited License (with License Retention)", "shortname": "FSFULLR", "text": "Copyright 1996-2006 Free Software Foundation, Inc.", "header": ""}, {"fullname": "Giftware License", "shortname": "Giftware", "text": "Allegro 4 (the giftware license)", "header": ""}, {"fullname": "GL2PS License", "shortname": "GL2PS", "text": "GL2PS LICENSE Version 2, November 2003", "header": ""}, {"fullname": "Glulxe License", "shortname": "Glulxe", "text": "The source code in this package is copyright 1999-2010 by Andrew Plotkin.", "header": ""}, {"fullname": "GNU Affero General Public License v3.0", "shortname": "AGPL-3.0", "text": "GNU AFFERO GENERAL PUBLIC LICENSE Version 3, 19 November 2007", "header": "Copyright (C) [year] [name of author] This program is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, version 3. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details. You should have received a copy of the GNU Affero General Public License along with this program. If not, see"}, {"fullname": "GNU Free Documentation License v1.1", "shortname": "GFDL-1.1", "text": "GNU Free Documentation License Version 1.1, March 2000", "header": "Copyright (c) YEAR YOUR NAME . Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.1 or any later version published by the Free Software Foundation; with the Invariant Sections being LIST THEIR TITLES, with the Front-Cover Texts being LIST, and with the Back-Cover Texts being LIST. A copy of the license is included in the section entitled \"GNU Free Documentation License\"."}, {"fullname": "GNU Free Documentation License v1.2", "shortname": "GFDL-1.2", "text": "GNU Free Documentation License Version 1.2, November 2002", "header": "Copyright (c) YEAR YOUR NAME . Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled \"GNU Free Documentation License\"."}, {"fullname": "GNU Free Documentation License v1.3", "shortname": "GFDL-1.3", "text": "GNU Free Documentation License Version 1.3, 3 November 2008", "header": "Copyright (c) YEAR YOUR NAME Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is included in the section entitled \"GNU Free Documentation License\"."}, {"fullname": "GNU General Public License v1.0 only", "shortname": "GPL-1.0", "text": "GNU GENERAL PUBLIC LICENSE Version 1, February 1989", "header": "Copyright (C) 19xx name of author This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; version 1. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA."}, {"fullname": "GNU General Public License v2.0 only", "shortname": "GPL-2.0", "text": "GNU GENERAL PUBLIC LICENSE Version 2, June 1991", "header": "Copyright (C) yyyy name of author This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; version 2. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA."}, {"fullname": "GNU General Public License v3.0 only", "shortname": "GPL-3.0", "text": "GNU GENERAL PUBLIC LICENSE Version 3, 29 June 2007", "header": "Copyright (C) This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, version 3. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see ."}, {"fullname": "GNU Lesser General Public License v2.1 only", "shortname": "LGPL-2.1", "text": "GNU LESSER GENERAL PUBLIC LICENSE Version 2.1, February 1999", "header": "Copyright (C) year name of author This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; version 2.1. This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License for more details. You should have received a copy of the GNU Lesser General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA"}, {"fullname": "GNU Lesser General Public License v3.0 only", "shortname": "LGPL-3.0", "text": "GNU LESSER GENERAL PUBLIC LICENSE Version 3, 29 June 2007", "header": ""}, {"fullname": "GNU Library General Public License v2 only", "shortname": "LGPL-2.0", "text": "GNU LIBRARY GENERAL PUBLIC LICENSE Version 2, June 1991", "header": "Copyright (C) year name of author This library is free software; you can redistribute it and/or modify it under the terms of the GNU Library General Public License as published by the Free Software Foundation; version 2. This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Library General Public License for more details. You should have received a copy of the GNU Library General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA."}, {"fullname": "gnuplot License", "shortname": "gnuplot", "text": "Copyright 1986 - 1993, 1998, 2004 Thomas Williams, Colin Kelley", "header": ""}, {"fullname": "gSOAP Public License v1.3b", "shortname": "gSOAP-1.3b", "text": "gSOAP Public License Version 1.3b", "header": ""}, {"fullname": "Haskell Language Report License", "shortname": "HaskellReport", "text": "Code derived from the document \"Report on the Programming Language Haskell 2010\", is distributed under the following license: Copyright (c) 2010 Simon Marlow The authors intend this Report to belong to the entire Haskell community, and so we grant permission to copy and distribute it for any purpose, provided that it is reproduced in its entirety, including this Notice. Modified versions of this Report may also be copied and distributed for any purpose, provided that the modified version is clearly presented as such, and that it does not claim to be a definition of the Haskell 2010 Language.", "header": ""}, {"fullname": "Historical Permission Notice and Disclaimer", "shortname": "HPND", "text": "Historical Permission Notice and Disclaimer", "header": ""}, {"fullname": "IBM PowerPC Initialization and Boot Software", "shortname": "IBM-pibs", "text": "This source code has been made available to you by IBM on an AS-IS basis. Anyone receiving this source is licensed under IBM copyrights to use it in any way he or she deems fit, including copying it, modifying it, compiling it, and redistributing it either with or without modifications. No license under IBM patents or patent applications is to be implied by the copyright license. Any user of this software should understand that IBM cannot provide technical support for this software and will not be responsible for any consequences resulting from the use of this software. Any person who transfers this source code or any derivative work must include the IBM copyright notice, this paragraph, and the preceding two paragraphs in the transferred software. COPYRIGHT I B M CORPORATION 2002 LICENSED MATERIAL - PROGRAM PROPERTY OF I B M", "header": ""}, {"fullname": "IBM Public License v1.0", "shortname": "IPL-1.0", "text": "IBM Public License Version 1.0", "header": ""}, {"fullname": "ICU License", "shortname": "ICU", "text": "ICU License - ICU 1.8.1 and later COPYRIGHT AND PERMISSION NOTICE", "header": ""}, {"fullname": "ImageMagick License", "shortname": "ImageMagick", "text": "Before we get to the text of the license, lets just review what the license says in simple terms: It allows you to: * freely download and use ImageMagick software, in whole or in part, for personal, company internal, or commercial purposes; * use ImageMagick software in packages or distributions that you create; * link against a library under a different license; * link code under a different license against a library under this license; * merge code into a work under a different license; * extend patent grants to any code using code under this license; * and extend patent protection. It forbids you to: * redistribute any piece of ImageMagick-originated software without proper attribution; * use any marks owned by ImageMagick Studio LLC in any way that might state or imply that ImageMagick Studio LLC endorses your distribution; * use any marks owned by ImageMagick Studio LLC in any way that might state or imply that you created the ImageMagick software in question. It requires you to: * include a copy of the license in any redistribution you may make that includes ImageMagick software; * provide clear attribution to ImageMagick Studio LLC for any distributions that include ImageMagick software. It does not require you to: * include the source of the ImageMagick software itself, or of any modifications you may have made to it, in any redistribution you may assemble that includes it; * submit changes that you make to the software back to the ImageMagick Studio LLC (though such feedback is encouraged). A few other clarifications include: * ImageMagick is freely available without charge; * you may include ImageMagick on a DVD as long as you comply with the terms of the license; * you can give modified code away for free or sell it under the terms of the ImageMagick license or distribute the result under a different license, but you need to acknowledge the use of the ImageMagick software; * the license is compatible with the GPL V3. * when exporting the ImageMagick software, review its export classification.", "header": ""}, {"fullname": "iMatix Standard Function Library Agreement", "shortname": "iMatix", "text": "The SFL License Agreement", "header": ""}, {"fullname": "Imlib2 License", "shortname": "Imlib2", "text": "Imlib2 License", "header": ""}, {"fullname": "Independent JPEG Group License", "shortname": "IJG", "text": "Independent JPEG Group License", "header": ""}, {"fullname": "Info-ZIP License", "shortname": "Info-ZIP", "text": "Info-ZIP License", "header": ""}, {"fullname": "Intel ACPI Software License Agreement", "shortname": "Intel-ACPI", "text": "ACPI - Software License Agreement", "header": ""}, {"fullname": "Intel Corporation", "shortname": "Intel", "text": "Copyright (c)  Intel Corporation", "header": ""}, {"fullname": "Interbase Public License v1.0", "shortname": "Interbase-1.0", "text": "INTERBASE PUBLIC LICENSE Version 1.0", "header": "\"The contents of this file are subject to the Interbase Public License Version 1.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.Interbase.com/IPL.html Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code was created by InterBase Software Corp and its successors. Portions created by Borland/Inprise are Copyright (C) Borland/Inprise. All Rights Reserved. Contributor(s): ______________________________________."}, {"fullname": "IPA Font License", "shortname": "IPA", "text": "IPA Font License Agreement v1.0", "header": ""}, {"fullname": "ISC License", "shortname": "ISC", "text": "ISC License", "header": ""}, {"fullname": "JasPer License", "shortname": "JasPer-2.0", "text": "JasPer License Version 2.0", "header": ""}, {"fullname": "JSON License", "shortname": "JSON", "text": "JSON License", "header": ""}, {"fullname": "LaTeX Project Public License v1.0", "shortname": "LPPL-1.0", "text": "LaTeX Project Public License LPPL Version 1.0 1999-03-01", "header": "%% pig.sty %% Copyright 2001 M. Y. Name % This program can redistributed and/or modified under the terms % of the LaTeX Project Public License Distributed from CTAN % archives in directory macros/latex/base/lppl.txt; either % version 1 of the License, or (at your option) any later version."}, {"fullname": "LaTeX Project Public License v1.1", "shortname": "LPPL-1.1", "text": "The LaTeX Project Public License =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- LPPL Version 1.1 1999-07-10", "header": "%% pig.dtx %% Copyright 2001 M. Y. Name % % This program may be distributed and/or modified under the % conditions of the LaTeX Project Public License, either version 1.1 % of this license or (at your option) any later version. % The latest version of this license is in % http://www.latex-project.org/lppl.txt % and version 1.1 or later is part of all distributions of LaTeX % version 1999/06/01 or later. % % This program consists of the files pig.dtx and pig.ins"}, {"fullname": "LaTeX Project Public License v1.2", "shortname": "LPPL-1.2", "text": "The LaTeX Project Public License =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- LPPL Version 1.2 1999-09-03", "header": "%% pig.dtx %% Copyright 2001 M. Y. Name % % This program may be distributed and/or modified under the % conditions of the LaTeX Project Public License, either version 1.2 % of this license or (at your option) any later version. % The latest version of this license is in % http://www.latex-project.org/lppl.txt % and version 1.2 or later is part of all distributions of LaTeX % version 1999/12/01 or later. % % This program consists of the files pig.dtx and pig.ins"}, {"fullname": "LaTeX Project Public License v1.3a", "shortname": "LPPL-1.3a", "text": "The LaTeX Project Public License =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- LPPL Version 1.3a 2004-10-01", "header": "%% pig.dtx %% Copyright 2003 M. Y. Name % % This work may be distributed and/or modified under the % conditions of the LaTeX Project Public License, either version 1.3 % of this license or (at your option) any later version. % The latest version of this license is in % http://www.latex-project.org/lppl.txt % and version 1.3 or later is part of all distributions of LaTeX % version 2003/12/01 or later. % % This work has the LPPL maintenance status \"maintained\". % % This Current Maintainer of this work is M. Y. Name. % % This work consists of the files pig.dtx and pig.ins % and the derived file pig.sty."}, {"fullname": "LaTeX Project Public License v1.3c", "shortname": "LPPL-1.3c", "text": "The LaTeX Project Public License =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- LPPL Version 1.3c 2008-05-04", "header": "%% pig.dtx %% Copyright 2005 M. Y. Name % % This work may be distributed and/or modified under the % conditions of the LaTeX Project Public License, either version 1.3 % of this license or (at your option) any later version. % The latest version of this license is in % http://www.latex-project.org/lppl.txt % and version 1.3 or later is part of all distributions of LaTeX % version 2005/12/01 or later. % % This work has the LPPL maintenance status \"maintained\". % % The Current Maintainer of this work is M. Y. Name. % % This work consists of the files pig.dtx and pig.ins % and the derived file pig.sty."}, {"fullname": "Latex2e License", "shortname": "Latex2e", "text": "Copyright (C) 2007, 2008, 2009, 2010 Karl Berry. Copyright (C) 1988, 1994, 2007 Stephen Gilmore. Copyright (C) 1994, 1995, 1996 Torsten Martinsen.", "header": ""}, {"fullname": "Lawrence Berkeley National Labs BSD variant license", "shortname": "BSD-3-Clause-LBNL", "text": "Copyright (c) 2003, The Regents of the University of California, through Lawrence Berkeley National Laboratory (subject to receipt of any required approvals from the U.S. Dept. of Energy). All rights reserved.", "header": ""}, {"fullname": "Leptonica License", "shortname": "Leptonica", "text": "Copyright (C) 2001 Leptonica. All rights reserved.", "header": ""}, {"fullname": "Lesser General Public License For Linguistic Resources", "shortname": "LGPLLR", "text": "Lesser General Public License For Linguistic Resources", "header": ""}, {"fullname": "libpng License", "shortname": "Libpng", "text": "This copy of the libpng notices is provided for your convenience. In case of any discrepancy between this copy and the notices in the file png.h that is included in the libpng distribution, the latter shall prevail. COPYRIGHT NOTICE, DISCLAIMER, and LICENSE: If you modify libpng you may insert additional notices immediately following this sentence. This code is released under the libpng license. libpng versions 1.2.6, August 15, 2004, through 1.4.5, December 9, 2010, are Copyright (c) 2004, 2006-2010 Glenn Randers-Pehrson, and are distributed according to the same disclaimer and license as libpng-1.2.5 with the following individual added to the list of Contributing Authors Cosmin Truta libpng versions 1.0.7, July 1, 2000, through 1.2.5 - October 3, 2002, are Copyright (c) 2000-2002 Glenn Randers-Pehrson, and are distributed according to the same disclaimer and license as libpng-1.0.6 with the following individuals added to the list of Contributing Authors Simon-Pierre Cadieux Eric S. Raymond Gilles Vollant and with the following additions to the disclaimer: There is no warranty against interference with your enjoyment of the library or against infringement. There is no warranty that our efforts or the library will fulfill any of your particular purposes or needs. This library is provided with all faults, and the entire risk of satisfactory quality, performance, accuracy, and effort is with the user. libpng versions 0.97, January 1998, through 1.0.6, March 20, 2000, are Copyright (c) 1998, 1999 Glenn Randers-Pehrson, and are distributed according to the same disclaimer and license as libpng-0.96, with the following individuals added to the list of Contributing Authors: Tom Lane Glenn Randers-Pehrson Willem van Schaik libpng versions 0.89, June 1996, through 0.96, May 1997, are Copyright (c) 1996, 1997 Andreas Digger Distributed according to the same disclaimer and license as libpng-0.88, with the following individuals added to the list of Contributing Authors: John Bowler Kevin Bracey Sam Bushell Magnus Holmgren Greg Roelofs Tom Tanner libpng versions 0.5, May 1995, through 0.88, January 1996, are Copyright (c) 1995, 1996 Guy Eric Schalnat, Group 42, Inc. For the purposes of this copyright and license, \"Contributing Authors\" is defined as the following set of individuals: Andreas Dilger Dave Martindale Guy Eric Schalnat Paul Schmidt Tim Wegner The PNG Reference Library is supplied \"AS IS\". The Contributing Authors and Group 42, Inc. disclaim all warranties, expressed or implied, including, without limitation, the warranties of merchantability and of fitness for any purpose. The Contributing Authors and Group 42, Inc. assume no liability for direct, indirect, incidental, special, exemplary, or consequential damages, which may result from the use of the PNG Reference Library, even if advised of the possibility of such damage. Permission is hereby granted to use, copy, modify, and distribute this source code, or portions hereof, for any purpose, without fee, subject to the following restrictions: 1. The origin of this source code must not be misrepresented. 2. Altered versions must be plainly marked as such and must not be misrepresented as being the original source. 3. This Copyright notice may not be removed or altered from any source or altered source distribution. The Contributing Authors and Group 42, Inc. specifically permit, without fee, and encourage the use of this source code as a component to supporting the PNG file format in commercial products. If you use this source code in a product, acknowledgment is not required but would be appreciated. A \"png_get_copyright\" function is available, for convenient use in \"about\" boxes and the like: printf(\"%s\",png_get_copyright(NULL)); Also, the PNG logo (in PNG format, of course) is supplied in the files \"pngbar.png\" and \"pngbar.jpg (88x31) and \"pngnow.png\" (98x31). Libpng is OSI Certified Open Source Software. OSI Certified Open Source is a certification mark of the Open Source Initiative. Glenn Randers-Pehrson glennrp at users.sourceforge.net December 9, 2010", "header": ""}, {"fullname": "libtiff License", "shortname": "libtiff", "text": "Copyright (c) 1988-1997 Sam Leffler Copyright (c) 1991-1997 Silicon Graphics, Inc.", "header": ""}, {"fullname": "Licence Art Libre 1.2", "shortname": "LAL-1.2", "text": "Licence Art Libre [ Copyleft Attitude ] Version 1.2", "header": ""}, {"fullname": "Licence Art Libre 1.3", "shortname": "LAL-1.3", "text": "Licence Art Libre 1.3 (LAL 1.3)", "header": ""}, {"fullname": "Licence Libre du QuÃ©bec â\u0080\u0093 Permissive version 1.1", "shortname": "LiLiQ-P-1.1", "text": "Licence Libre du QuÃ©bec â\u0080\u0093 Permissive (LiLiQ-P) Version 1.1", "header": ""}, {"fullname": "Licence Libre du QuÃ©bec â\u0080\u0093 RÃ©ciprocitÃ© forte version 1.1", "shortname": "LiLiQ-Rplus-1.1", "text": "Licence Libre du QuÃ©bec â\u0080\u0093 RÃ©ciprocitÃ© forte (LiLiQ-R+) Version 1.1", "header": ""}, {"fullname": "Licence Libre du QuÃ©bec â\u0080\u0093 RÃ©ciprocitÃ© version 1.1", "shortname": "LiLiQ-R-1.1", "text": "Licence Libre du QuÃ©bec â\u0080\u0093 RÃ©ciprocitÃ© (LiLiQ-R) Version 1.1", "header": ""}, {"fullname": "Lucent Public License v1.02", "shortname": "LPL-1.02", "text": "Lucent Public License Version 1.02", "header": ""}, {"fullname": "Lucent Public License Version 1.0", "shortname": "LPL-1.0", "text": "Lucent Public License Version 1.0", "header": ""}, {"fullname": "MakeIndex License", "shortname": "MakeIndex", "text": "MakeIndex Distribution Notice 11/11/1989", "header": ""}, {"fullname": "Matrix Template Library License", "shortname": "MTLL", "text": "Software License for MTL", "header": ""}, {"fullname": "Microsoft Public License", "shortname": "MS-PL", "text": "Microsoft Public License (Ms-PL)", "header": ""}, {"fullname": "Microsoft Reciprocal License", "shortname": "MS-RL", "text": "Microsoft Reciprocal License (Ms-RL)", "header": ""}, {"fullname": "The MirOS Licence", "shortname": "MirOS", "text": "The MirOS Licence", "header": ""}, {"fullname": "MIT +no-false-attribs license", "shortname": "MITNFA", "text": "Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. Distributions of all or part of the Software intended to be used by the recipients as they would use the unmodified Software, containing modifications that substantially alter, remove, or disable functionality of the Software, outside of the documented configuration mechanisms provided by the Software, shall be modified such that the Original Author's bug reporting email addresses and urls are either replaced with the contact information of the parties responsible for the changes, or removed entirely. THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.", "header": ""}, {"fullname": "MIT License", "shortname": "MIT", "text": "MIT License", "header": ""}, {"fullname": "Motosoto License", "shortname": "Motosoto", "text": "MOTOSOTO OPEN SOURCE LICENSE - Version 0.9.1", "header": ""}, {"fullname": "Mozilla Public License 1.0", "shortname": "MPL-1.0", "text": "MOZILLA PUBLIC LICENSE Version 1.0", "header": "\"The contents of this file are subject to the Mozilla Public License Version 1.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.mozilla.org/MPL/ Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code is _____. The Initial Developer of the Original Code is _____. Portions created by _____ are Copyright (C) _____. All Rights Reserved. Contributor(s): _____.\""}, {"fullname": "Mozilla Public License 1.1", "shortname": "MPL-1.1", "text": "Mozilla Public License Version 1.1", "header": "\"The contents of this file are subject to the Mozilla Public License Version 1.1 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at http://www.mozilla.org/MPL/ Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code is ______________________________________. The Initial Developer of the Original Code is ________________________. Portions created by ______________________ are Copyright (C) ______. All Rights Reserved. Contributor(s): ______________________________________. Alternatively, the contents of this file may be used under the terms of the _____ license (the \"[___] License\"), in which case the provisions of [______] License are applicable instead of those above. If you wish to allow use of your version of this file only under the terms of the [____] License and not to allow others to use your version of this file under the MPL, indicate your decision by deleting the provisions above and replace them with the notice and other provisions required by the [___] License. If you do not delete the provisions above, a recipient may use your version of this file under either the MPL or the [___] License.\""}, {"fullname": "Mozilla Public License 2.0", "shortname": "MPL-2.0", "text": "Mozilla Public License Version 2.0", "header": "This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/."}, {"fullname": "Mozilla Public License 2.0 (no copyleft exception)", "shortname": "MPL-2.0-no-copyleft-exception", "text": "Mozilla Public License Version 2.0", "header": "This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/. This Source Code Form is \"Incompatible With Secondary Licenses\", as defined by the Mozilla Public License, v. 2.0."}, {"fullname": "mpich2 License", "shortname": "mpich2", "text": "COPYRIGHT", "header": ""}, {"fullname": "Multics License", "shortname": "Multics", "text": "Multics License", "header": ""}, {"fullname": "Mup License", "shortname": "Mup", "text": "Copyright (c) 1995-2012 by Arkkra Enterprises. All rights reserved.", "header": ""}, {"fullname": "NASA Open Source Agreement 1.3", "shortname": "NASA-1.3", "text": "NASA OPEN SOURCE AGREEMENT VERSION 1.3", "header": ""}, {"fullname": "Naumen Public License", "shortname": "Naumen", "text": "NAUMEN Public License", "header": ""}, {"fullname": "Net Boolean Public License v1", "shortname": "NBPL-1.0", "text": "The Net Boolean Public License", "header": ""}, {"fullname": "Net-SNMP License", "shortname": "Net-SNMP", "text": "---- Part 1: CMU/UCD copyright notice: (BSD like) ----- Copyright 1989, 1991, 1992 by Carnegie Mellon University Derivative Work - 1996, 1998-2000 Copyright 1996, 1998-2000 The Regents of the University of California All Rights Reserved", "header": ""}, {"fullname": "NetCDF license", "shortname": "NetCDF", "text": "Copyright 1993-2014 University Corporation for Atmospheric Research/Unidata", "header": ""}, {"fullname": "Nethack General Public License", "shortname": "NGPL", "text": "NETHACK GENERAL PUBLIC LICENSE", "header": ""}, {"fullname": "Netizen Open Source License", "shortname": "NOSL", "text": "NETIZEN OPEN SOURCE LICENSE Version 1.0", "header": ""}, {"fullname": "Netscape Public License v1.0", "shortname": "NPL-1.0", "text": "NETSCAPE PUBLIC LICENSE Version 1.0", "header": ""}, {"fullname": "Netscape Public License v1.1", "shortname": "NPL-1.1", "text": "Netscape Public LIcense version 1.1", "header": ""}, {"fullname": "Newsletr License", "shortname": "Newsletr", "text": "Copyright 1989--2004 by Hunter Goatley.", "header": ""}, {"fullname": "No Limit Public License", "shortname": "NLPL", "text": "NO LIMIT PUBLIC LICENSE Version 0, June 2012", "header": ""}, {"fullname": "Nokia Open Source License", "shortname": "Nokia", "text": "Nokia Open Source License (NOKOS License) Version 1.0a", "header": ""}, {"fullname": "Non-Profit Open Software License 3.0", "shortname": "NPOSL-3.0", "text": "Non-Profit Open Software License 3.0", "header": ""}, {"fullname": "Norwegian Licence for Open Government Data (NLOD) 1.0", "shortname": "NLOD-1.0", "text": "Norwegian Licence for Open Government Data (NLOD) 1.0", "header": ""}, {"fullname": "Noweb License", "shortname": "Noweb", "text": "Noweb is copyright 1989-2000 by Norman Ramsey. All rights reserved.", "header": ""}, {"fullname": "NRL License", "shortname": "NRL", "text": "NRL License", "header": ""}, {"fullname": "NTP License", "shortname": "NTP", "text": "NTP License (NTP)", "header": ""}, {"fullname": "Nunit License", "shortname": "Nunit", "text": "Copyright Â© 2002-2004 James W. Newkirk, Michael C. Two, Alexei A. Vorontsov, Charlie Poole Copyright Â© 2000-2004 Philip A. Craig", "header": ""}, {"fullname": "OCLC Research Public License 2.0", "shortname": "OCLC-2.0", "text": "OCLC Research Public License 2.0 Terms & Conditions Of Use May, 2002", "header": "\"Copyright (c) 2000- (insert then current year) OCLC Online Computer Library Center, Inc. and other contributors. All rights reserved. The contents of this file, as updated from time to time by the OCLC Office of Research, are subject to OCLC Research Public License Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a current copy of the License at http://purl.oclc.org/oclc/research/ORPL/. Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. This software consists of voluntary contributions made by many individuals on behalf of OCLC Research. For more information on OCLC Research, please see http://www.oclc.org/research/. The Original Code is ______________________________. The Initial Developer of the Original Code is ________________________. Portions created by ______________________ are Copyright (C) ____________________________. All Rights Reserved. Contributor(s): ______________________________________.\""}, {"fullname": "Open Data Commons Open Database License v1.0", "shortname": "ODbL-1.0", "text": "Open Data Commons Open Database License (ODbL)", "header": ""}, {"fullname": "Open Data Commons Public Domain Dedication & License 1.0", "shortname": "PDDL-1.0", "text": "Open Data Commons Public Domain Dedication & License (PDDL)", "header": ""}, {"fullname": "Open CASCADE Technology Public License", "shortname": "OCCT-PL", "text": "Open CASCADE Technology Public License Version 6.6, April 2013", "header": ""}, {"fullname": "Open Group Test Suite License", "shortname": "OGTSL", "text": "The Open Group Test Suite License", "header": ""}, {"fullname": "Open LDAP Public License 2.2.2", "shortname": "OLDAP-2.2.2", "text": "The OpenLDAP Public License Version 2.2.2, 28 July 2000", "header": ""}, {"fullname": "Open LDAP Public License v1.1", "shortname": "OLDAP-1.1", "text": "The OpenLDAP Public License Version 1.1, 25 August 1998", "header": ""}, {"fullname": "Open LDAP Public License v1.2", "shortname": "OLDAP-1.2", "text": "The OpenLDAP Public License Version 1.2, 1 September 1998", "header": ""}, {"fullname": "Open LDAP Public License v1.3", "shortname": "OLDAP-1.3", "text": "The OpenLDAP Public License Version 1.3, 17 January 1999", "header": ""}, {"fullname": "Open LDAP Public License v1.4", "shortname": "OLDAP-1.4", "text": "The OpenLDAP Public License Version 1.4, 18 January 1999", "header": ""}, {"fullname": "Open LDAP Public License v2.0 (or possibly 2.0A and 2.0B)", "shortname": "OLDAP-2.0", "text": "The OpenLDAP Public License Version 2.0, 7 June 1999", "header": ""}, {"fullname": "Open LDAP Public License v2.0.1", "shortname": "OLDAP-2.0.1", "text": "The OpenLDAP Public License Version 2.0.1, 21 December 1999", "header": ""}, {"fullname": "Open LDAP Public License v2.1", "shortname": "OLDAP-2.1", "text": "The OpenLDAP Public License Version 2.1, 29 February 2000", "header": ""}, {"fullname": "Open LDAP Public License v2.2", "shortname": "OLDAP-2.2", "text": "The OpenLDAP Public License Version 2.2, 1 March 2000", "header": ""}, {"fullname": "Open LDAP Public License v2.2.1", "shortname": "OLDAP-2.2.1", "text": "The OpenLDAP Public License Version 2.2.1, 1 March 2000", "header": ""}, {"fullname": "Open LDAP Public License v2.3", "shortname": "OLDAP-2.3", "text": "The OpenLDAP Public License Version 2.3, 28 July 2000", "header": ""}, {"fullname": "Open LDAP Public License v2.4", "shortname": "OLDAP-2.4", "text": "The OpenLDAP Public License Version 2.4, 8 December 2000", "header": ""}, {"fullname": "Open LDAP Public License v2.5", "shortname": "OLDAP-2.5", "text": "The OpenLDAP Public License Version 2.5, 11 May 2001", "header": ""}, {"fullname": "Open LDAP Public License v2.6", "shortname": "OLDAP-2.6", "text": "The OpenLDAP Public License Version 2.6, 14 June 2001", "header": ""}, {"fullname": "Open LDAP Public License v2.7", "shortname": "OLDAP-2.7", "text": "The OpenLDAP Public License Version 2.7, 7 September 2001", "header": ""}, {"fullname": "Open LDAP Public License v2.8", "shortname": "OLDAP-2.8", "text": "The OpenLDAP Public License Version 2.8, 17 August 2003", "header": ""}, {"fullname": "Open Market License", "shortname": "OML", "text": "This FastCGI application library source and object code (the \"Software\") and its documentation (the \"Documentation\") are copyrighted by Open Market, Inc (\"Open Market\"). The following terms apply to all files associated with the Software and Documentation unless explicitly disclaimed in individual files. Open Market permits you to use, copy, modify, distribute, and license this Software and the Documentation for any purpose, provided that existing copyright notices are retained in all copies and that this notice is included verbatim in any distributions. No written agreement, license, or royalty fee is required for any of the authorized uses. Modifications to this Software and Documentation may be copyrighted by their authors and need not follow the licensing terms described here. If modifications to this Software and Documentation have new licensing terms, the new terms must be clearly indicated on the first page of each file where they apply. OPEN MARKET MAKES NO EXPRESS OR IMPLIED WARRANTY WITH RESPECT TO THE SOFTWARE OR THE DOCUMENTATION, INCLUDING WITHOUT LIMITATION ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL OPEN MARKET BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DAMAGES ARISING FROM OR RELATING TO THIS SOFTWARE OR THE DOCUMENTATION, INCLUDING, WITHOUT LIMITATION, ANY INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES OR SIMILAR DAMAGES, INCLUDING LOST PROFITS OR LOST DATA, EVEN IF OPEN MARKET HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE SOFTWARE AND DOCUMENTATION ARE PROVIDED \"AS IS\". OPEN MARKET HAS NO LIABILITY IN CONTRACT, TORT, NEGLIGENCE OR OTHERWISE ARISING OUT OF THIS SOFTWARE OR THE DOCUMENTATION.", "header": ""}, {"fullname": "Open Public License v1.0", "shortname": "OPL-1.0", "text": "OPEN PUBLIC LICENSE Version 1.0", "header": ""}, {"fullname": "Open Software License 1.0", "shortname": "OSL-1.0", "text": "The Open Software License v. 1.0", "header": "\"Licensed under the Open Software License version 1.0\""}, {"fullname": "Open Software License 1.1", "shortname": "OSL-1.1", "text": "The Open Software License v. 1.1", "header": "Licensed under the Open Software License version 1.1"}, {"fullname": "Open Software License 2.0", "shortname": "OSL-2.0", "text": "The Open Software License v. 2.0", "header": "Licensed under the Open Software License version 2.0"}, {"fullname": "Open Software License 2.1", "shortname": "OSL-2.1", "text": "The Open Software Licensev. 2.1", "header": "Licensed under the Open Software License version 2.1"}, {"fullname": "Open Software License 3.0", "shortname": "OSL-3.0", "text": "Open Software License v. 3.0 (OSL-3.0)", "header": "Licensed under the Open Software License version 3.0"}, {"fullname": "OpenSSL License", "shortname": "OpenSSL", "text": "OpenSSL License", "header": ""}, {"fullname": "OSET Public License version 2.1", "shortname": "OSET-PL-2.1", "text": "OSET Public License", "header": ""}, {"fullname": "PHP License v3.0", "shortname": "PHP-3.0", "text": "The PHP License, version 3.0", "header": ""}, {"fullname": "PHP License v3.01", "shortname": "PHP-3.01", "text": "The PHP License, version 3.01", "header": ""}, {"fullname": "Plexus Classworlds License", "shortname": "Plexus", "text": "Copyright 2002 (C) The Codehaus. All Rights Reserved.", "header": ""}, {"fullname": "PostgreSQL License", "shortname": "PostgreSQL", "text": "PostgreSQL Database Management System (formerly known as Postgres, then as Postgres95)", "header": ""}, {"fullname": "psfrag License", "shortname": "psfrag", "text": "psfrag.dtx", "header": ""}, {"fullname": "psutils License", "shortname": "psutils", "text": "PS Utilities Package", "header": ""}, {"fullname": "Python License 2.0", "shortname": "Python-2.0", "text": "PYTHON SOFTWARE FOUNDATION LICENSE VERSION 2", "header": ""}, {"fullname": "Q Public License 1.0", "shortname": "QPL-1.0", "text": "THE Q PUBLIC LICENSE version 1.0", "header": ""}, {"fullname": "Qhull License", "shortname": "Qhull", "text": "Qhull, Copyright (c) 1993-2003 The National Science and Technology Research Center for Computation and Visualization of Geometric Structures (The Geometry Center) University of Minnesota", "header": ""}, {"fullname": "Rdisc License", "shortname": "Rdisc", "text": "Rdisc (this program) was developed by Sun Microsystems, Inc. and is provided for unrestricted use provided that this legend is included on all tape media and as a part of the software program in whole or part. Users may copy or modify Rdisc without charge, and they may freely distribute it. RDISC IS PROVIDED AS IS WITH NO WARRANTIES OF ANY KIND INCLUDING THE WARRANTIES OF DESIGN, MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE, OR ARISING FROM A COURSE OF DEALING, USAGE OR TRADE PRACTICE. Rdisc is provided with no support and without any obligation on the part of Sun Microsystems, Inc. to assist in its use, correction, modification or enhancement. SUN MICROSYSTEMS, INC. SHALL HAVE NO LIABILITY WITH RESPECT TO THE INFRINGEMENT OF COPYRIGHTS, TRADE SECRETS OR ANY PATENTS BY RDISC OR ANY PART THEREOF. In no event will Sun Microsystems, Inc. be liable for any lost revenue or profits or other special, indirect and consequential damages, even if Sun has been advised of the possibility of such damages. Sun Microsystems, Inc. 2550 Garcia Avenue Mountain View, California 94043", "header": ""}, {"fullname": "RealNetworks Public Source License v1.0", "shortname": "RPSL-1.0", "text": "RealNetworks Public Source License Version 1.0 (Rev. Date October 28, 2002)", "header": "\"Copyright (c) 1995-2002 RealNetworks, Inc. and/or its licensors. All Rights Reserved. The contents of this file, and the files included with this file, are subject to the current version of the RealNetworks Public Source License Version 1.0 (the \"RPSL\") available at https://www.helixcommunity.org/content/rpsl unless you have licensed the file under the RealNetworks Community Source License Version 1.0 (the \"RCSL\") available at https://www.helixcommunity.org/content/rcsl, in which case the RCSL will apply. You may also obtain the license terms directly from RealNetworks. You may not use this file except in compliance with the RPSL or, if you have a valid RCSL with RealNetworks applicable to this file, the RCSL. Please see the applicable RPSL or RCSL for the rights, obligations and limitations governing use of the contents of the file. This file is part of the Helix DNA Technology. RealNetworks is the developer of the Original code and owns the copyrights in the portions it created. This file, and the files included with this file, is distributed and made available on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, AND REALNETWORKS HEREBY DISCLAIMS ALL SUCH WARRANTIES, INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT. Contributor(s): ____________________________________ Technology Compatibility Kit Test Suite(s) Location (if licensed under the RCSL): _____\""}, {"fullname": "Reciprocal Public License 1.1", "shortname": "RPL-1.1", "text": "Reciprocal Public License, version 1.1", "header": ""}, {"fullname": "Reciprocal Public License 1.5", "shortname": "RPL-1.5", "text": "Reciprocal Public License 1.5 (RPL1.5) Version 1.5, July 15, 2007", "header": ""}, {"fullname": "Red Hat eCos Public License v1.1", "shortname": "RHeCos-1.1", "text": "Red Hat eCos Public License v1.1", "header": ""}, {"fullname": "Ricoh Source Code Public License", "shortname": "RSCPL", "text": "Ricoh Source Code Public License Version 1.0", "header": ""}, {"fullname": "RSA Message-Digest License", "shortname": "RSA-MD", "text": "Copyright (C) 1991-2, RSA Data Security, Inc. Created 1991. All rights reserved.", "header": ""}, {"fullname": "Ruby License", "shortname": "Ruby", "text": "1. You may make and give away verbatim copies of the source form of the software without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers. 2. You may modify your copy of the software in any way, provided that you do at least ONE of the following: a) place your modifications in the Public Domain or otherwise make them Freely Available, such as by posting said modifications to Usenet or an equivalent medium, or by allowing the author to include your modifications in the software. b) use the modified software only within your corporation or organization. c) give non-standard binaries non-standard names, with instructions on where to get the original software distribution. d) make other distribution arrangements with the author. 3. You may distribute the software in object code or binary form, provided that you do at least ONE of the following: a) distribute the binaries and library files of the software, together with instructions (in the manual page or equivalent) on where to get the original distribution. b) accompany the distribution with the machine-readable source of the software. c) give non-standard binaries non-standard names, with instructions on where to get the original software distribution. d) make other distribution arrangements with the author. 4. You may modify and include the part of the software into any other software (possibly commercial). But some files in the distribution are not written by the author, so that they are not under these terms. For the list of those files and their copying conditions, see the file LEGAL. 5. The scripts and library files supplied as input to or produced as output from the software do not automatically fall under the copyright of the software, but belong to whomever generated them, and may be sold commercially, and may be aggregated with this software. 6. THIS SOFTWARE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.", "header": ""}, {"fullname": "Sax Public Domain Notice", "shortname": "SAX-PD", "text": "Copyright Status SAX is free! In fact, it's not possible to own a license to SAX, since it's been placed in the public domain. No Warranty Because SAX is released to the public domain, there is no warranty for the design or for the software implementation, to the extent permitted by applicable law. Except when otherwise stated in writing the copyright holders and/or other parties provide SAX \"as is\" without warranty of any kind, either expressed or implied, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose. The entire risk as to the quality and performance of SAX is with you. Should SAX prove defective, you assume the cost of all necessary servicing, repair or correction. In no event unless required by applicable law or agreed to in writing will any copyright holder, or any other party who may modify and/or redistribute SAX, be liable to you for damages, including any general, special, incidental or consequential damages arising out of the use or inability to use SAX (including but not limited to loss of data or data being rendered inaccurate or losses sustained by you or third parties or a failure of the SAX to operate with any other programs), even if such holder or other party has been advised of the possibility of such damages. Copyright Disclaimers This page includes statements to that effect by David Megginson, who would have been able to claim copyright for the original work. SAX 1.0 Version 1.0 of the Simple API for XML (SAX), created collectively by the membership of the XML-DEV mailing list, is hereby released into the public domain. No one owns SAX: you may use it freely in both commercial and non-commercial applications, bundle it with your software distribution, include it on a CD-ROM, list the source code in a book, mirror the documentation at your own web site, or use it in any other way you see fit. David Megginson, Megginson Technologies Ltd. 1998-05-11 SAX 2.0 I hereby abandon any property rights to SAX 2.0 (the Simple API for XML), and release all of the SAX 2.0 source code, compiled code, and documentation contained in this distribution into the Public Domain. SAX comes with NO WARRANTY or guarantee of fitness for any purpose. David Megginson, Megginson Technologies Ltd. 2000-05-05", "header": ""}, {"fullname": "Saxpath License", "shortname": "Saxpath", "text": "Copyright (C) 2000-2002 werken digital. All rights reserved.", "header": ""}, {"fullname": "SCEA Shared Source License", "shortname": "SCEA", "text": "SCEA Shared Source License 1.0", "header": "Copyright 2005 Sony Computer Entertainment Inc. Licensed under the SCEA Shared Source License, Version 1.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at: http://research.scea.com/scea_shared_source_license.html Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License."}, {"fullname": "Scheme Widget Library (SWL) Software License Agreement", "shortname": "SWL", "text": "The authors hereby grant permission to use, copy, modify, distribute, and license this software and its documentation for any purpose, provided that existing copyright notices are retained in all copies and that this notice is included verbatim in any distributions. No written agreement, license, or royalty fee is required for any of the authorized uses. Modifications to this software may be copyrighted by their authors and need not follow the licensing terms described here, provided that the new terms are clearly indicated on the first page of each file where they apply. IN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY DERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. THIS SOFTWARE IS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS. GOVERNMENT USE: If you are acquiring this software on behalf of the U.S. government, the Government shall have only \"Restricted Rights\" in the software and related documentation as defined in the Federal Acquisition Regulations (FARs) in Clause 52.227.19 (c) (2). If you are acquiring the software on behalf of the Department of Defense, the software shall be classified as \"Commercial Computer Software\" and the Government shall have only \"Restricted Rights\" as defined in Clause 252.227-7013 (c) (1) of DFARs. Notwithstanding the foregoing, the authors grant the U.S. Government and others acting in its behalf permission to use and distribute the software in accordance with the terms specified in this license. BY INSTALLING THIS SOFTWARE, YOU ACKNOWLEDGE THAT YOU HAVE READ THIS AGREEMENT, THAT YOU UNDERSTAND IT, AND THAT YOU AGREE TO BE BOUND BY ITS TERMS AND CONDITIONS.", "header": ""}, {"fullname": "Secure Messaging Protocol Public License", "shortname": "SMPPL", "text": "Secure Messaging Protocol (SMP) Libraries [ACL, CML, SFL]", "header": ""}, {"fullname": "Sendmail License", "shortname": "Sendmail", "text": "SENDMAIL LICENSE", "header": ""}, {"fullname": "SGI Free Software License B v1.0", "shortname": "SGI-B-1.0", "text": "SGI FREE SOFTWARE LICENSE B (Version 1.0 1/25/2000)", "header": "License Applicability. Except to the extent portions of this file are made subject to an alternative license as permitted in the SGI Free Software License B, Version 1.0 (the \"License\"), the contents of this file are subject only to the provisions of the License. You may not use this file except in compliance with the License. You may obtain a copy of the License at Silicon Graphics, Inc., attn: Legal Services, 1600 Ampitheatre Parkway, Mountain View, CA 94043-1351, or at: http://oss.sgi.com/projects/FreeB Note that, as provided in the License, the Software is distributed on an \"AS IS\" basis, with ALL EXPRESS AND IMPLIED WARRANTIES AND CONDITIONS DISCLAIMED, INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. Original Code. The Original Code is: [ name of software, version number, and release date ], developed by Silicon Graphics, Inc. The Original Code is Copyright (c) [ dates of first publication, as appearing in the Notice in the Original Code ] Silicon Graphics, Inc. Copyright in any portions created by third parties is as indicated elsewhere herein. All Rights Reserved. Additional Notice Provisions: [ such additional provisions, if any, as appear in the Notice in the Original Code under the heading \"Additional Notice Provisions\" ]"}, {"fullname": "SGI Free Software License B v1.1", "shortname": "SGI-B-1.1", "text": "SGI FREE SOFTWARE LICENSE B (Version 1.1 02/22/2000)", "header": "License Applicability. Except to the extent portions of this file are made subject to an alternative license as permitted in the SGI Free Software License B, Version 1.1 (the \"License\"), the contents of this file are subject only to the provisions of the License. You may not use this file except in compliance with the License. You may obtain a copy of the License at Silicon Graphics, Inc., attn: Legal Services, 1600 Amphitheatre Parkway, Mountain View, CA 94043-1351, or at: http://oss.sgi.com/projects/FreeB Note that, as provided in the License, the Software is distributed on an \"AS IS\" basis, with ALL EXPRESS AND IMPLIED WARRANTIES AND CONDITIONS DISCLAIMED, INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES AND CONDITIONS OF MERCHANTABILITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. Original Code. The Original Code is: [ name of software, version number, and release date ], developed by Silicon Graphics, Inc. The Original Code is Copyright (c) [ dates of first publication, as appearing in the Notice in the Original Code ] Silicon Graphics, Inc. Copyright in any portions created by third parties is as indicated elsewhere herein. All Rights Reserved. Additional Notice Provisions: [ such additional provisions, if any, as appear in the Notice in the Original Code under the heading \"Additional Notice Provisions\" ]"}, {"fullname": "SGI Free Software License B v2.0", "shortname": "SGI-B-2.0", "text": "SGI FREE SOFTWARE LICENSE B (Version 2.0, Sept. 18, 2008)", "header": ""}, {"fullname": "SIL Open Font License 1.0", "shortname": "OFL-1.0", "text": "SIL OPEN FONT LICENSE Version 1.0 - 22 November 2005", "header": ""}, {"fullname": "SIL Open Font License 1.1", "shortname": "OFL-1.1", "text": "Copyright (c) , (), with Reserved Font Name .", "header": ""}, {"fullname": "Simple Public License 2.0", "shortname": "SimPL-2.0", "text": "Simple Public License (SimPL)", "header": ""}, {"fullname": "Sleepycat License", "shortname": "Sleepycat", "text": "The Sleepycat License Copyright (c) 1990-1999 Sleepycat Software. All rights reserved.", "header": ""}, {"fullname": "SNIA Public License 1.1", "shortname": "SNIA", "text": "STORAGE NETWORKING INDUSTRY ASSOCIATION PUBLIC LICENSE Version 1.1", "header": ""}, {"fullname": "Spencer License 86", "shortname": "Spencer-86", "text": "Copyright (c) 1986 by University of Toronto. Written by Henry Spencer. Not derived from licensed software.", "header": ""}, {"fullname": "Spencer License 94", "shortname": "Spencer-94", "text": "Copyright 1992, 1993, 1994 Henry Spencer. All rights reserved.", "header": ""}, {"fullname": "Spencer License 99", "shortname": "Spencer-99", "text": "Copyright (c) 1998, 1999 Henry Spencer. All rights reserved.", "header": ""}, {"fullname": "Standard ML of New Jersey License", "shortname": "SMLNJ", "text": "STANDARD ML OF NEW JERSEY COPYRIGHT NOTICE, LICENSE AND DISCLAIMER.", "header": ""}, {"fullname": "SugarCRM Public License v1.1.3", "shortname": "SugarCRM-1.1.3", "text": "SUGARCRM PUBLIC LICENSE", "header": ""}, {"fullname": "Sun Industry Standards Source License v1.1", "shortname": "SISSL", "text": "Sun Industry Standards Source License - Version 1.1", "header": "\"The contents of this file are subject to the Sun Standards License Version 1.1 (the \"License\"); You may not use this file except in compliance with the License. You may obtain a copy of the License at _______________________________. Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License. The Original Code is ______________________________________. The Initial Developer of the Original Code is: Sun Microsystems, Inc.. Portions created by: _______________________________________ are Copyright (C): _______________________________________ All Rights Reserved. Contributor(s): _______________________________________"}, {"fullname": "Sun Industry Standards Source License v1.2", "shortname": "SISSL-1.2", "text": "SUN INDUSTRY STANDARDS SOURCE LICENSE Version 1.2", "header": "\"The contents of this file are subject to the Sun Industry Standards Source License Version 1.2 (the License); You may not use this file except in compliance with the License.\" \"You may obtain a copy of the License at gridengine.sunsource.net/license.html\" \"Software distributed under the License is distributed on an AS IS basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License for the specific language governing rights and limitations under the License.\" \"The Original Code is Grid Engine.\" \"The Initial Developer of the Original Code is: Sun Microsystems, Inc.\" \"Portions created by: Sun Microsystems, Inc. are Copyright (C) 2001 Sun Microsystems, Inc.\" \"All Rights Reserved.\" \"Contributor(s): __________________________________\""}, {"fullname": "Sun Public License v1.0", "shortname": "SPL-1.0", "text": "SUN PUBLIC LICENSE Version 1.0", "header": "The contents of this file are subject to the Sun Public License Version 1.0 (the License); you may not use this file except in compliance with the License. A copy of the License is available at http://www.sun.com/ The Original Code is _________________. The Initial Developer of the Original Code is ___________. Portions created by ______ are Copyright (C) _________. All Rights Reserved. Contributor(s): ______________________________________. Alternatively, the contents of this file may be used under the terms of the _____ license (the ?[___] License?), in which case the provisions of [______] License are applicable instead of those above. If you wish to allow use of your version of this file only under the terms of the [____] License and not to allow others to use your version of this file under the SPL, indicate your decision by deleting the provisions above and replace them with the notice and other provisions required by the [___] License. If you do not delete the provisions above, a recipient may use your version of this file under either the SPL or the [___] License."}, {"fullname": "Sybase Open Watcom Public License 1.0", "shortname": "Watcom-1.0", "text": "Sybase Open Watcom Public License version 1.0", "header": ""}, {"fullname": "TCL/TK License", "shortname": "TCL", "text": "This software is copyrighted by the Regents of the University of California, Sun Microsystems, Inc., Scriptics Corporation, ActiveState Corporation and other parties. The following terms apply to all files associated with the software unless explicitly disclaimed in individual files. The authors hereby grant permission to use, copy, modify, distribute, and license this software and its documentation for any purpose, provided that existing copyright notices are retained in all copies and that this notice is included verbatim in any distributions. No written agreement, license, or royalty fee is required for any of the authorized uses. Modifications to this software may be copyrighted by their authors and need not follow the licensing terms described here, provided that the new terms are clearly indicated on the first page of each file where they apply. IN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY DERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. THE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. THIS SOFTWARE IS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS. GOVERNMENT USE: If you are acquiring this software on behalf of the U.S. government, the Government shall have only \"Restricted Rights\" in the software and related documentation as defined in the Federal Acquisition Regulations (FARs) in Clause 52.227.19 (c) (2). If you are acquiring the software on behalf of the Department of Defense, the software shall be classified as \"Commercial Computer Software\" and the Government shall have only \"Restricted Rights\" as defined in Clause 252.227-7013 (c) (1) of DFARs. Notwithstanding the foregoing, the authors grant the U.S. Government and others acting in its behalf permission to use and distribute the software in accordance with the terms specified in this license.", "header": ""}, {"fullname": "TCP Wrappers License", "shortname": "TCP-wrappers", "text": "Copyright 1995 by Wietse Venema. All rights reserved. Some individual files may be covered by other copyrights.", "header": ""}, {"fullname": "The Unlicense", "shortname": "Unlicense", "text": "This is free and unencumbered software released into the public domain. Anyone is free to copy, modify, publish, use, compile, sell, or distribute this software, either in source code form or as a compiled binary, for any purpose, commercial or non-commercial, and by any means. In jurisdictions that recognize copyright laws, the author or authors of this software dedicate any and all copyright interest in the software to the public domain. We make this dedication for the benefit of the public at large and to the detriment of our heirs and successors. We intend this dedication to be an overt act of relinquishment in perpetuity of all present and future rights to this software under copyright law. THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE. For more information, please refer to", "header": ""}, {"fullname": "TMate Open Source License", "shortname": "TMate", "text": "The TMate Open Source License.", "header": ""}, {"fullname": "TORQUE v2.5+ Software License v1.1", "shortname": "TORQUE-1.1", "text": "TORQUE v2.5+ Software License v1.1", "header": ""}, {"fullname": "Trusster Open Source License", "shortname": "TOSL", "text": "Trusster Open Source License version 1.0a (TRUST) copyright (c) 2006 Mike Mintz and Robert Ekendahl. All rights reserved.", "header": ""}, {"fullname": "Unicode License Agreement - Data Files and Software (2015)", "shortname": "Unicode-DFS-2015", "text": "UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE", "header": ""}, {"fullname": "Unicode License Agreement - Data Files and Software (2016)", "shortname": "Unicode-DFS-2016", "text": "UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE", "header": ""}, {"fullname": "Unicode Terms of Use", "shortname": "Unicode-TOU", "text": "Unicode Terms of Use", "header": ""}, {"fullname": "Universal Permissive License v1.0", "shortname": "UPL-1.0", "text": "Copyright (c) [year] [copyright holders]", "header": ""}, {"fullname": "University of Illinois/NCSA Open Source License", "shortname": "NCSA", "text": "University of Illinois/NCSA Open Source License", "header": ""}, {"fullname": "Vim License", "shortname": "Vim", "text": "VIM LICENSE", "header": ""}, {"fullname": "VOSTROM Public License for Open Source", "shortname": "VOSTROM", "text": "VOSTROM Public License for Open Source", "header": ""}, {"fullname": "Vovida Software License v1.0", "shortname": "VSL-1.0", "text": "Vovida Software License v. 1.0", "header": ""}, {"fullname": "W3C Software Notice and Document License (2015-05-13)", "shortname": "W3C-20150513", "text": "This work is being provided by the copyright holders under the following license. License By obtaining and/or copying this work, you (the licensee) agree that you have read, understood, and will comply with the following terms and conditions. Permission to copy, modify, and distribute this work, with or without modification, for any purpose and without fee or royalty is hereby granted, provided that you include the following on ALL copies of the work or portions thereof, including modifications: â\u0080¢ The full text of this NOTICE in a location viewable to users of the redistributed or derivative work. â\u0080¢ Any pre-existing intellectual property disclaimers, notices, or terms and conditions. If none exist, the W3C Software and Document Short Notice should be included. â\u0080¢ Notice of any changes or modifications, through a copyright statement on the new code or document such as \"This software or document includes material copied from or derived from [title and URI of the W3C document]. Copyright (c) [YEAR] W3CÂ® (MIT, ERCIM, Keio, Beihang).\" Disclaimers THIS WORK IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENT WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS. COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENT. The name and trademarks of copyright holders may NOT be used in advertising or publicity pertaining to the work without specific, written prior permission. Title to copyright in this work will at all times remain with copyright holders.", "header": "[$name_of_software: $distribution_URI] Copyright (c) [$date-of-software] World Wide Web Consortium, (Massachusetts Institute of Technology, European Research Consortium for Informatics and Mathematics, Keio University, Beihang). All Rights Reserved. This work is distributed under the W3CÂ® Software License [1] in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. [1] http://www.w3.org/Consortium/Legal/copyright-software"}, {"fullname": "W3C Software Notice and License (1998-07-20)", "shortname": "W3C-19980720", "text": "W3CÂ® SOFTWARE NOTICE AND LICENSE", "header": ""}, {"fullname": "W3C Software Notice and License (2002-12-31)", "shortname": "W3C", "text": "W3C SOFTWARE NOTICE AND LICENSE", "header": "Copyright (C) [$date-of-software] World Wide Web Consortium, (Massachusetts Institute of Technology, European Research Consortium for Informatics and Mathematics, Keio University). All Rights Reserved. This work is distributed under the W3CÂ® Software License in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE."}, {"fullname": "Wsuipa License", "shortname": "Wsuipa", "text": "This file was added by Clea F. Rees on 2008/11/30 with the permission of Dean Guenther and pointers to this file were added to all source files.", "header": ""}, {"fullname": "X.Net License", "shortname": "Xnet", "text": "The X.Net, Inc. License", "header": ""}, {"fullname": "X11 License", "shortname": "X11", "text": "X11 License", "header": ""}, {"fullname": "Xerox License", "shortname": "Xerox", "text": "Copyright (c) 1995, 1996 Xerox Corporation. All Rights Reserved.", "header": ""}, {"fullname": "XFree86 License 1.1", "shortname": "XFree86-1.1", "text": "XFree86 License (version 1.1)", "header": ""}, {"fullname": "xinetd License", "shortname": "xinetd", "text": "ORIGINAL LICENSE: This software is", "header": ""}, {"fullname": "XPP License", "shortname": "xpp", "text": "LICENSE FOR THE Extreme! Lab PullParser", "header": ""}, {"fullname": "XSkat License", "shortname": "XSkat", "text": "This program is free software; you can redistribute it freely. Use it at your own risk; there is NO WARRANTY. Redistribution of modified versions is permitted provided that the following conditions are met: 1. All copyright & permission notices are preserved. 2.a) Only changes required for packaging or porting are made. or 2.b) It is clearly stated who last changed the program. The program is renamed or the version number is of the form x.y.z, where x.y is the version of the original program and z is an arbitrary suffix.", "header": ""}, {"fullname": "Yahoo! Public License v1.0", "shortname": "YPL-1.0", "text": "Yahoo! Public License, Version 1.0 (YPL)", "header": ""}, {"fullname": "Yahoo! Public License v1.1", "shortname": "YPL-1.1", "text": "Yahoo! Public License, Version 1.1 (YPL)", "header": ""}, {"fullname": "Zed License", "shortname": "Zed", "text": "(c) Jim Davies, January 1995", "header": ""}, {"fullname": "Zend License v2.0", "shortname": "Zend-2.0", "text": "The Zend Engine License, version 2.00", "header": ""}, {"fullname": "Zimbra Public License v1.3", "shortname": "Zimbra-1.3", "text": "Zimbra Public License, Version 1.3 (ZPL)", "header": ""}, {"fullname": "Zimbra Public License v1.4", "shortname": "Zimbra-1.4", "text": "Zimbra Public License, Version 1.4 (ZPL)", "header": ""}, {"fullname": "zlib License", "shortname": "Zlib", "text": "zlib License", "header": ""}, {"fullname": "zlib/libpng License with Acknowledgement", "shortname": "zlib-acknowledgement", "text": "Copyright (c) 2002-2007 Charlie Poole Copyright (c) 2002-2004 James W. Newkirk, Michael C. Two, Alexei A. Vorontsov Copyright (c) 2000-2002 Philip A. Craig", "header": ""}, {"fullname": "Zope Public License 1.1", "shortname": "ZPL-1.1", "text": "Zope Public License (ZPL) Version 1.1", "header": ""}, {"fullname": "Zope Public License 2.0", "shortname": "ZPL-2.0", "text": "Zope Public License (ZPL) Version 2.0", "header": ""}, {"fullname": "Zope Public License 2.1", "shortname": "ZPL-2.1", "text": "Zope Public License (ZPL) Version 2.1", "header": ""}, {"fullname": "Apple Public Source License 2.0", "shortname": "APSL-2.0", "text": "APPLE PUBLIC SOURCE LICENSE Version 2.0 - August 6, 2003", "header": ""}]
}
